tap "cultureamp/web-team-devtools"
tap "golangci/tap"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "thoughtbot/formulae"

brew "ack"
brew "asdf"
brew "cloc"
brew "direnv"
brew "dive"
brew "exa"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "gh"
brew "golangci-lint"
brew "gpg"
brew "graphviz"
brew "httpie"
brew "jq"
brew "libdvdcss"
brew "moreutils"
brew "overmind"
brew "p7zip"
brew "pgcli"
brew "pspg"
brew "rcm"
brew "shellcheck"
brew "tree"
brew "wget"
brew "yarn"

# Dependencies for building postgres via asdf
brew "gcc"
brew "readline"
brew "zlib"
brew "curl"
brew "ossp-uuid"

cask_args appdir: "/Applications"

cask "1password"
cask "1password-cli"
cask "aws-vault"
cask "backblaze"
cask "bartender"
cask "bike"
cask "caffeine"
# cask "calibre"
cask "dash"
cask "deckset"
cask "discord"
cask "docker"
cask "fantastical"
cask "firefox"
cask "font-jetbrains-mono"
cask "hammerspoon"
cask "handbrake"
cask "hazel"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "imageoptim"
cask "keyboard-maestro"
cask "keyboardcleantool"
cask "launchbar"
cask "menuwhere"
cask "monodraw"
cask "muzzle"
cask "netnewswire"
cask "numi"
cask "openemu"
cask "paw"
cask "pika"
cask "postico"
cask "radio-silence"
cask "skype"
cask "slack"
cask "superduper"
cask "tower"
cask "transmission"
cask "transmit"
cask "visual-studio-code"
cask "vlc"
cask "zoom"
cask "zulip"

mas "1password for Safari", id: 1569813296
mas "Acorn 7", id: 1547371478
mas "AdGuard for Safari", id: 1440147259
mas "BBEdit", id: 404009241
mas "Boop", id: 1518425043
mas "DaisyDisk", id: 411643860
mas "GoodLinks", id: 1474335294
mas "Hush Nag Blocker", id: 1544743900
mas "iA Writer", id: 775737590
mas "Kindle", id: 405399194
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pathology", id: 877848776
mas "Patterns", id: 429449079
mas "Poolside FM", id: 1514817810
mas "Shush", id: 496437906
mas "SiteSucker", id: 442168834
mas "Soulver", id: 413965349
mas "Tabs to Links", id: 1451408472
mas "The Unarchiver", id: 425424353
mas "Tweetbot 3 for Twitter", id: 1384080005
mas "xScope", id: 447661441
mas "Yoink", id: 457622435
