tap "buildpacks/tap"
tap "cultureamp/tap"
tap "cultureamp/web-team-devtools"
tap "golangci/tap"
tap "heroku/brew"
tap "homebrew/cask-versions"
tap "homebrew/cask"
tap "thoughtbot/formulae"

brew "ack"
brew "asdf"
brew "awscli"
brew "cfparams" # via cultureamp/tap
brew "cloc"
brew "dive"
brew "docker-credential-helper-ecr"
brew "exa"
brew "ffmpeg"
brew "figlet"
brew "fish"
brew "freetds"
brew "gh"
brew "golangci-lint"
brew "gpg"
brew "graphviz"
brew "heroku"
brew "httpie"
brew "java"
brew "jq"
brew "libdvdcss"
brew "moreutils"
brew "overmind"
brew "pack" # via buildpacks/tap
brew "p7zip"
brew "pgcli"
brew "pgloader"
brew "pinentry-mac"
brew "pspg"
brew "rcm"
brew "silk-cli"
brew "s3cmd"
brew "shellcheck"
brew "tree"
brew "wget"
brew "yarn"

cask_args appdir: "/Applications"

cask "1password"
cask "1password-cli"
cask "atext"
cask "aws-vault"
cask "backblaze"
cask "bartender"
cask "burp-suite"
cask "caffeine"
# cask "calibre"
cask "dash"
cask "deckset"
cask "discord"
cask "docker"
cask "doxie"
cask "fantastical"
cask "firefox"
cask "fluid"
cask "flux"
cask "gfxcardstatus"
cask "goland"
cask "hammerspoon"
cask "handbrake"
cask "hazel"
cask "iina"
cask "istat-menus"
cask "iterm2"
cask "imageoptim"
cask "keyboard-maestro"
cask "keyboardcleantool"
cask "lastpass"
cask "launchbar"
cask "licecap"
cask "menuwhere"
cask "miro"
cask "mmhmm"
cask "monodraw"
cask "muzzle"
cask "numi"
cask "openemu"
cask "paw"
cask "pop"
cask "postgres"
cask "postico"
cask "proxyman"
cask "radio-silence"
cask "skype"
cask "sublime-merge"
cask "superduper"
cask "tower"
cask "transmission"
cask "transmit"
cask "virtualbox"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "zoomin"
cask "zulip"

# Provided by work:
# cask "viscosity"
# cask "zoomus"

mas "AdGuard for Safari", id: 1440147259
mas "Agenda.", id: 1287445660
mas "BBEdit", id: 404009241
mas "Boop", id: 1518425043
mas "DaisyDisk", id: 411643860
mas "Dato", id: 1470584107
mas "Diptic", id: 526546615
mas "Divvy", id: 413857545
mas "GoodLinks", id: 1474335294
mas "Hush Nag Blocker", id: 1544743900
mas "iA Writer", id: 775737590
mas "Instapaper Save", id: 1481302432
mas "Kindle", id: 405399194
mas "Keynote", id: 409183694
mas "Marked 2", id: 890031187
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Pathology", id: 877848776
mas "Patterns", id: 429449079
mas "PDFpen", id: 403624960
mas "Pixelmator", id: 407963104
mas "Poolside FM", id: 1514817810
mas "Reeder", id: 880001334
mas "Shush", id: 496437906
mas "Sip", id: 507257563
mas "SiteSucker", id: 442168834
mas "Soulver", id: 413965349
mas "Tabs to Links", id: 1451408472
mas "TaskPaper", id: 1090940630
mas "The Unarchiver", id: 425424353
mas "Tomato One", id: 907364780
mas "Tot", id: 1491071483
mas "Trello", id: 1384080005
mas "Tweetbot 3 for Twitter", id: 557168941
mas "xScope", id: 447661441
mas "Yoink", id: 457622435
