tap "heroku/brew"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "thoughtbot/formulae"

brew "ack"
brew "awscli"
brew "cloc"
brew "duply"
brew "exa"
brew "ffmpeg"
brew "figlet"
brew "fish", args: %w[HEAD]
brew "freetds"
brew "gpg"
brew "graphviz"
brew "heroku"
brew "httpie"
brew "hub"
brew "jq"
brew "libdvdcss"
brew "moreutils"
brew "mysql@5.7" # no asdf plugin for this and occasionally I need it
brew "overmind"
brew "p7zip"
brew "pgcli"
brew "pgloader"
brew "pinentry-mac"
brew "rcm"
brew "s3cmd"
brew "shellcheck"
brew "wget"

# TODO ngrok, pygments.py

cask_args appdir: "/Applications"

cask "1password"
cask "1password-cli"
cask "atext"
cask "backblaze"
cask "caffeine"
cask "charles"
cask "dash"
cask "deckset"
cask "discord"
cask "doxie"
cask "dropbox"
cask "firefox"
cask "fluid"
cask "flux"
cask "gfxcardstatus"
cask "gitter"
cask "glueprint"
cask "google-chrome"
cask "hammerspoon"
cask "handbrake"
cask "hazel"
cask "iina"
cask "imageoptim"
cask "java"
cask "keybase"
cask "kitty"
cask "launchbar"
cask "licecap"
cask "mailmate"
cask "monodraw"
cask "muzzle"
cask "numi"
cask "openemu"
cask "opera"
cask "paw"
cask "postgres"
cask "postico"
cask "proxyman"
cask "reveal"
cask "skype"
cask "slack"
cask "sublime-merge" # TODO symlink the bin file
cask "superduper"
cask "transmission"
cask "transmit"
cask "tunnelblick"
cask "virtualbox"
cask "visual-studio-code"
cask "vlc"
cask "zulip"

mas "AdGuard for Safari", id: 1440147259
mas "Agenda.", id: 1287445660
mas "BBEdit", id: 404009241
mas "DaisyDisk", id: 411643860
mas "Dato", id: 1470584107
mas "Diptic", id: 526546615
mas "Divvy", id: 413857545
mas "HTTP Client", id: 418138339
mas "iA Writer", id: 775737590
mas "Instapaper Save", id: 1481302432
mas "iStat Mini", id: 927292435
mas "Keynote", id: 409183694
mas "Marked", id: 448925439
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Pathology", id: 877848776
mas "Patterns", id: 429449079
mas "PDFpen", id: 403624960
mas "Pixelmator", id: 407963104
mas "Reeder", id: 880001334
mas "Shush", id: 496437906
mas "Sip", id: 507257563
mas "SiteSucker", id: 442168834
mas "Soulver", id: 413965349
mas "Tabs to Links", id: 1451408472
mas "The Unarchiver", id: 425424353
mas "Things3", id: 904280696
mas "Tomato One", id: 907364780
mas "Trello", id: 1278508951
mas "Tweetbot", id: 557168941
mas "Ulysses", id: 623795237
mas "Wunderlist", id: 410628904
mas "xScope", id: 447661441
mas "Yoink", id: 457622435
